role_query = [
    {
        "role_id": "愛麗絲",
        "story_id": "愛麗絲夢遊仙境",
        "role_info": "愛麗絲是一位好奇心旺盛的小女孩，她的好奇心驅使她跟隨一隻兔子進入了一個充滿奇幻冒險的夢幻仙境。愛麗絲在這個奇異的世界裡變得非常小，面對各種古怪的人物和挑戰，她展現了充足的勇氣和智慧，並在夢遊仙境的冒險中成長。"
    },
    {
        "role_id": "艾莎",
        "story_id": "冰雪奇緣",
        "role_info": "艾莎是一位擁有冰雪魔法的女王，她能夠召喚冰雪、冰霜和寒冷的天氣。童年時，她曾因一次意外傷害到妹妹安娜，為了保護她，艾莎隱藏了自己的魔法，並遠離王國。成為女王後，她的冰雪魔法意外被揭露，導致王國深陷冰雪風暴之中。在安娜的陪伴下，艾莎逐漸學會接受和掌握自己的力量，最終通過真愛的力量拯救了整個王國。"
    },
    {
        "role_id": "葛麗特",
        "story_id": "糖果屋",
        "role_info": "葛麗特是一位聰明機智的小女孩，她與她的哥哥韓賽爾一同經歷了許多困難。面對繼母的陰謀，她聰明的利用小石頭和麵包屑來標記回家的路，但不幸在森林中迷路。當他們進到了巫婆的糖果房子時，卻發現這是一場危險的陷阱。她的機智最終救了她與韓賽爾，並成功打敗了邪惡的巫婆。"
    },
    {
        "role_id": "快樂王子",
        "story_id": "快樂王子",
        "role_info": "快樂王子是一座高大的青銅雕像，擁有兩顆寶石，藍寶石代表他的眼淚，紅寶石代表他的心臟。他被城市中貧苦的景象所觸動，決定以自己的黃金和寶石，為窮人帶來希望和生存的機會。然而，他在幫助他人的同時，也經歷了失去的痛苦，最終成為一座永恆的雕像，守護著城市，眼淚和心臟的寶石為人們照亮道路，散發愛和美好。"
    },
    {
        "role_id": "拇指姑娘",
        "story_id": "拇指姑娘",
        "role_info": "拇指姑娘出生於一朵特別的大麥花苞，她的身形嬌小美麗，僅如農婦的拇指大小。在經歷了奇幻的冒險中，她終於找到了真愛，嫁給了精靈王子，並獲得了一對翅膀，開啟了她在花園國度幸福快樂的新生活。"
    },
    {
        "role_id": "阿拉丁",
        "story_id": "阿拉丁神燈",
        "role_info": "阿拉丁是個生活貧困的男孩，失去父親後與母親相依為命。一次偶然的相遇，他被捲入一場神秘的冒險。阿拉丁勇敢聰明，不僅解救了自己，還為家人帶來富足和幸福。"
    },
]

story_query = [
    {
        "story_id": "愛麗絲夢遊仙境",
        "story_content": "在一個陽光明媚的下午，愛麗絲坐在姊姊身邊，突然間看到一隻兔子從她身邊疾馳而過，口中喊著牠已經遲到了。愛麗絲好奇地跟隨兔子進入一個兔子洞，而她卻驚奇地發現洞口比她預期的還要深。當她跟著兔子進入洞內，她發現自己忽然間變得非常小，可以輕易穿越洞口。她進入了一個充滿奇怪生物和奇幻場景的夢幻仙境。在夢遊仙境的冒險中，愛麗絲遇到了一系列古怪的人類和動物，包括一個喜歡講詩的瘋帽匠及名為柴郡貓的奇特貓咪，牠總是能在特殊時候消失不見。她還遇見了紅心女王、紅心國王，紅心女王經常下令斬首，而紅心國王卻總是試圖化解緊張氛圍。愛麗絲也與他們和判官參與了一場詭異而荒謬的法庭審判。故事最後，愛麗絲醒來發現自己還在姊姊身旁，她懷疑自己是不是真的經歷了一場夢遊仙境，但她對夢中的奇幻冒險卻充滿了懷念和好奇。"
    },
    {
        "story_id": "冰雪奇緣",
        "story_content": "故事發生在一個被魔法覆蓋的奇幻王國，國王和皇后擁有兩位女兒，姊姊艾莎和妹妹安娜。艾莎擁有冰雪的魔法能力，她可以召喚冰雪、冰霜和寒冷的天氣。由於一次意外，艾莎在童年時傷害到了安娜，為了保護妹妹，她決定隱藏自己的魔法，與世隔絕。當國王和皇后遇到意外身亡後，艾莎成為了新的女王。在她的加冕典禮上，她的冰雪魔法不小心被揭露，引起了一場混亂。為了逃避大家的目光，艾莎決定遠走他鄉，尋找一個適合的隱居之地。然而，在她的離去中，她不小心結凍了整個王國，使其氣溫降到極端低點。安娜決定追趕姐姐，並在她的冒險中結識了朋友:阿克、雪人雪寶、馴鹿小斯。他們一同面對極端天氣、魔法怪物和艾莎的冰雪魔法，最終找到了姐姐。在這個過程中，安娜發現艾莎的冰雪魔法能力是一種禮物，而非詛咒。然而，事情的發展在雪宴上達到了高潮，艾莎的情緒激發了一場冰雪風暴。安娜為了拯救艾莎，最終以自己的生命犧牲換取姐姐的救贖。安娜的犧牲表現出真愛的力量，打破了寒冷的魔咒，使得艾莎和整個王國都得以救贖。"
    },
    {
        "story_id": "糖果屋",
        "story_content": "韓賽爾與葛麗特是一個貧窮伐木工人的小孩。由於害怕食物不足，木工的妻子也就是小孩們的繼母，說服木工將小孩帶到森林裡，並將他們遺棄。韓賽爾與葛麗特聽到了他們的計畫，於是他們事先收集了小石頭，把石頭扔在地上，這樣他們就能沿著小石頭找到回家的路。在他們回來後，他們的繼母再度說服木工將他們丟到森林裡；這次，他們沿路布置的是麵包屑。不幸的是，麵包屑被森林中的鳥兒吃掉了，於是韓賽爾與葛麗特在森林中迷路了。不久，他們發現了一個用麵包做的房屋，窗戶是糖果做的，因為他們肚子實在太餓，竟然忍不住吃了起來。房子的主人是一個老婦人，她邀請他們進去屋內並盛宴款待他們。不過，那老婦人其實是個壞人，是個專吃小孩的壞巫婆，她建造了這個房屋來引誘小孩子們，這樣她就可以把小孩子養肥，並宰來吃掉。她把比較胖的韓賽爾關起來，並要葛麗特給韓賽爾吃很多食物把他養更肥，巫婆每次都會到韓賽爾的牢房叫他把手指伸出來，看看是否胖了起來，韓賽爾都會故意偷偷把細小的骨頭拿出去，巫婆因為年紀大，視力不好，以為那些小骨頭是韓賽爾的手指，已經吃那麼多竟然沒胖起來，巫婆再也等不及，決定直接把韓賽爾煮來吃。當巫婆準備把韓賽爾煮來吃的時後，葛麗特很聰明，她騙巫婆爬進爐中，並把巫婆活活燙死。孩子們找到並且拿走巫婆屋內所有的珠寶後，他們找到回家的路，並與他們的父親重聚，這時孩子們的繼母非常生氣，離開了家，這時兄妹將口袋中的珠寶拿出來，從此，一家三口過著幸福快樂的生活。"
    },
    {
        "story_id": "快樂王子",
        "story_content": "在一個遙遠的城市中，有一座高大的青銅雕像，是一尊裝飾華麗的快樂王子。這座雕像的眼中有兩顆寶石，一顆是藍寶石，代表他的眼淚，另一顆是紅寶石，代表他的心臟。王子看到了城市中貧苦和痛苦的一切，他的心被深深觸動。一天，他遇到了小燕子，王子和小燕子開始合作，用王子的黃金和寶石幫助城市的窮人。他們將王子的眼淚，即藍寶石，給予最需要的人，讓他們得以生存。王子的紅寶石心臟也變成了一顆紅玫瑰，他和小燕子將這朵美麗的花送給了一位年輕的女孩，她是一位窮苦的繪畫家。王子和小燕子的愛心行為改變了城市的命運，帶來了希望和快樂。然而，隨著季節的變化，小燕子在寒冷的冬天中犧牲了自己，為了保護玫瑰花而凍死在快樂王子的腳下。王子心碎不已，他的心臟也因為失去了最後一點愛而變成了玉石。王子的快樂和美麗的外表消失了，但他的紀念碑卻成為了城市中一道永恆的風景。快樂王子成為了城市的守護者，他的眼淚和心臟的寶石永遠閃耀著愛和美好的光芒。"
    },
    {
        "story_id": "拇指姑娘",
        "story_content": "從前有一個農婦在她的花園中種了一株大麥，後來大麥長出了花苞農婦便在花苞上親吻了一下，許下了想得到一個拇指般小的姑娘的願望。花苞盛開出花朵後，農婦發現一個迷你但美麗的小女孩從舒展開的花瓣中出現，由於小女孩的身體僅像農婦的拇指般大小，因此農婦將小女孩命名為「拇指姑娘」。拇指姑娘的美貌隨即吸引了一隻蟾蜍注意，這位蟾蜍媽媽相信拇指姑娘可以成為她兒子夢寐以求的新娘，於是便在一天夜裡綁架了拇指姑娘帶回家給她的兒子，蟾蜍媽媽的兒子馬上為拇指姑娘的美貌而神魂顛倒並把她留在荷葉上。隨後一隻甲蟲偷偷出現，也把拇指姑娘由荷葉上擄走，甲蟲把拇指姑娘帶回家，但是其他的甲蟲媽媽，卻認為拇指姑娘只有兩條腿而覺得拇指姑娘非常的醜，所以決定把拇指姑娘遺棄在森林裡。拇指姑娘又餓又累，這時一隻鳥從空中飛過看到拇指姑娘，便問拇指姑娘願不願意隨牠到更好的地方去。拇指姑娘同意讓這隻鳥帶她離開這片森林，於是鳥兒帶拇指姑娘到了一個花田，鳥兒要拇指姑娘挑選一朵屬於她的花，當拇指姑娘挑選了一朵花時精靈王子也同時出現了，精靈王子深深地被拇指姑娘的美貌吸引，便問拇指姑娘是否願意嫁給他，拇指姑娘接受了精靈王子的求婚，最後精靈王子給了拇指姑娘一對翅膀，兩人雙雙飛到精靈王子的花園國度，從此過著非常快樂的生活。"
    },
    {
        "story_id": "阿拉丁神燈",
        "story_content": "有個叫做阿拉丁的男孩，他的父親過世後，剩他和母親相依為命，在市集裡賣二手餐具，生活並不富裕。有一天，阿拉丁在市集裡工作時，一個陌生人來到他面前，假裝是阿拉丁的叔叔並請他幫忙，並說完成之後會給他很多金幣。阿拉丁想要豐厚的酬勞就答應了。但其實這個人是一個魔法師，他找阿拉丁是為了得到一個寶物，而這個寶物只有阿拉丁才能拿到。魔法師帶阿拉丁到一塊空地，接著唸起咒語，忽然，地面裂開，出現了一個通道。魔法師要求阿拉丁下去幫他拿油燈上來，阿拉丁勉為其難進入通道，發現裡面堆滿寶藏，他走了一會兒，找到油燈後趕緊往回走。阿拉丁要求魔法師先將他拉上去才肯把油燈交給魔法師，魔法師以為阿拉丁故意不把油燈給他，一氣之下竟將地道關起來。阿拉丁緊張的搓著雙手，無意間摩擦到手上的戒指。這時戒指精靈突然飛了出來，認為阿拉丁就是他的主人，阿拉丁便要求戒指精靈將他送回家。回到家後，阿拉丁把事情的經過告訴母親，因為油燈太髒了，母親便用手帕擦了一下油燈。忽然，一個高大的巨人從裡面冒出來，原來這不是普通的油燈，而是一盞神燈，裡面住著神燈精靈，可以滿足神燈主人的任何願望。有了神燈後，阿拉丁的生活變得富裕起來。有一次，他看見坐在馬車裡的公主，立刻喜歡上她，並在神燈精靈的幫助下和公主結婚，住在一座美麗的宮殿裡。這件事也傳到了魔法師的耳裡，魔法師知道阿拉丁還活著後立刻假扮成一個商人來到阿拉丁的宮殿外，假裝要買賣油燈，公主不知道那盞舊油燈的魔力，就把它拿去換了一盞新燈。魔法師拿到神燈後，立刻召喚出神燈精靈，吩咐精靈把這座宮殿搬到遙遠的沙漠。宮殿與裡頭的公主就跟著神燈精靈和魔法師，來到荒涼的沙漠中，魔法師想逼公主嫁給他。幸好，阿拉丁在戒指精靈的幫助下找到公主，他們趁機讓魔法師吃下毒藥，打敗了他。最後，阿拉丁請神燈精靈把宮殿搬回原來的地方，和公主、母親一起過著幸福的生活。"
    },
]

def get_original_story_by_role_id(role_id: str) -> str:
    """依照角色編號取得原故事內容"""
    # 示範代碼 - 從資料庫或其他來源獲取故事內容
    # story_content = "Once upon a time..."
    # return story_content
    for role_data in role_query:
        if role_data["role_id"] == role_id:
            for story_data in story_query:
                if story_data["story_id"] == role_data["story_id"]:
                    return story_data["story_content"]

if __name__ == "__main__" :
    story_content=get_original_story_by_role_id("艾莎")
    print(story_content)